lab11/gap/software/nrf51822/main.c
#endif // APPL_LCD_PRINT_ENABLE




bool bcp_irq_advertisements = false;






/**@brief Function for error handling, which is called when an error has occurred.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of error.
 *
 * @param[in] error_code  Error code supplied to the handler.
 * @param[in] line_num    Line number where the handler is called.
 * @param[in] p_file_name Pointer to the file name.
 */
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
    // APPL_LOG("[APPL]: ASSERT: %s, %d, error 0x%08x\r\n", p_file_name, line_num, error_code);
    // nrf_gpio_pin_set(ASSERT_LED_PIN_NO);

    // This call can be used for debug purposes during development of an application.
    // @note CAUTION: Activating this code will write the stack to flash on an error.
    //                This function should NOT be used in a final product.
    //                It is intended STRICTLY for development/debugging purposes.
    //                The flash write will happen EVEN if the radio is active, thus interrupting
    //                any communication.
    //                Use with care. Un-comment the line below to use.
    // ble_debug_assert_handler(error_code, line_num, p_file_name);

    // On assert, the system can only recover with a reset.
    NVIC_SystemReset();
}


/**@brief Function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num     Line number of the failing ASSERT call.
 * @param[in] p_file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}



// Send all received advertisements to the host
void bcp_sniff_advertisements () {
    led_off(LED_0);
    bcp_irq_advertisements = true;
}



void bcp_interrupt_host () {
    nrf_gpio_pin_set(INTERRUPT_PIN);
}

void bcp_interupt_host_clear () {
    nrf_gpio_pin_clear(INTERRUPT_PIN);
}




/**@brief Callback handling device manager events.
 *
 * @details This function is called to notify the application of device manager events.
 *
 * @param[in]   p_handle      Device Manager Handle. For link related events, this parameter
 *                            identifies the peer.
 * @param[in]   p_event       Pointer to the device manager event.
 * @param[in]   event_status  Status of the event.
 */
static api_result_t device_manager_event_handler(const dm_handle_t    * p_handle,
                                                 const dm_event_t     * p_event,
                                                 const api_result_t     event_result)
{
//     bool     lcd_write_status;
//     uint32_t err_code;

//     switch(p_event->event_id)
//     {
//         case DM_EVT_CONNECTION:
//         {
//             APPL_LOG("[APPL]: >> DM_EVT_CONNECTION\r\n");
// #ifdef ENABLE_DEBUG_LOG_SUPPORT
//             ble_gap_addr_t * peer_addr;
//             peer_addr = &p_event->event_param.p_gap_param->params.connected.peer_addr;
// #endif // ENABLE_DEBUG_LOG_SUPPORT
//             APPL_LOG("[APPL]:[%02X %02X %02X %02X %02X %02X]: Connection Established\r\n",
//                                 peer_addr->addr[0], peer_addr->addr[1], peer_addr->addr[2],
//                                 peer_addr->addr[3], peer_addr->addr[4], peer_addr->addr[5]);

//             nrf_gpio_pin_set(CONNECTED_LED_PIN_NO);
//             lcd_write_status = APPL_LCD_WRITE("Connected", 9, LCD_UPPER_LINE, 0);
//             if (!lcd_write_status)
//             {
//                 APPL_LOG("[APPL]: LCD Write failed!\r\n");
//             }
//             m_dm_device_handle = (*p_handle);

//             // Discover peer's services.
//              err_code = ble_db_discovery_start(&m_ble_db_discovery,
//                                                p_event->event_param.p_gap_param->conn_handle);
//             APP_ERROR_CHECK(err_code);

//             m_peer_count++;
//             if (m_peer_count < MAX_PEER_COUNT)
//             {
//                 scan_start();
//             }
//             APPL_LOG("[APPL]: << DM_EVT_CONNECTION\r\n");
//             break;
//         }

//         case DM_EVT_DISCONNECTION:
//         {
//             APPL_LOG("[APPL]: >> DM_EVT_DISCONNECTION\r\n");
//             memset(&m_ble_db_discovery, 0 , sizeof (m_ble_db_discovery));
//             lcd_write_status = APPL_LCD_CLEAR();
//             if (!lcd_write_status)
//             {
//                 APPL_LOG("[APPL]: LCD Clear failed!\r\n");
//             }

//             lcd_write_status = APPL_LCD_WRITE("Disconnected", 12, LCD_UPPER_LINE, 0);
//             if (!lcd_write_status)
//             {
//                 APPL_LOG("[APPL]:[4]: LCD Write failed!\r\n");
//             }

//             nrf_gpio_pin_clear(CONNECTED_LED_PIN_NO);
//             if (m_peer_count == MAX_PEER_COUNT)
//             {
//                 scan_start();
//             }
//             m_peer_count--;
//             APPL_LOG("[APPL]: << DM_EVT_DISCONNECTION\r\n");
//             break;
//         }

//         case DM_EVT_SECURITY_SETUP:
//         {
//             APPL_LOG("[APPL]:[0x%02X] >> DM_EVT_SECURITY_SETUP\r\n", p_handle->connection_id);
//             // Slave securtiy request received from peer, if from a non bonded device,
//             // initiate security setup, else, wait for encryption to complete.
//             err_code = dm_security_setup_req(&m_dm_device_handle);
//             APP_ERROR_CHECK(err_code);
//             APPL_LOG("[APPL]:[0x%02X] << DM_EVT_SECURITY_SETUP\r\n", p_handle->connection_id);
//             break;
//         }
//         case DM_EVT_SECURITY_SETUP_COMPLETE:
//         {
//             APPL_LOG("[APPL]: >> DM_EVT_SECURITY_SETUP_COMPLETE\r\n");
//              // Heart rate service discovered. Enable notification of Heart Rate Measurement.
//             err_code = ble_hrs_c_hrm_notif_enable(&m_ble_hrs_c);
//             APP_ERROR_CHECK(err_code);
//             APPL_LOG("[APPL]: << DM_EVT_SECURITY_SETUP_COMPLETE\r\n");
//             break;
//         }

//         case DM_EVT_LINK_SECURED:
//             APPL_LOG("[APPL]: >> DM_LINK_SECURED_IND\r\n");
//             APPL_LOG("[APPL]: << DM_LINK_SECURED_IND\r\n");
//             break;

//         case DM_EVT_DEVICE_CONTEXT_LOADED:
//             APPL_LOG("[APPL]: >> DM_EVT_LINK_SECURED\r\n");
//             APP_ERROR_CHECK(event_result);
//             APPL_LOG("[APPL]: << DM_EVT_DEVICE_CONTEXT_LOADED\r\n");
//             break;

//         case DM_EVT_DEVICE_CONTEXT_STORED:
//             APPL_LOG("[APPL]: >> DM_EVT_DEVICE_CONTEXT_STORED\r\n");
//             APP_ERROR_CHECK(event_result);
//             APPL_LOG("[APPL]: << DM_EVT_DEVICE_CONTEXT_STORED\r\n");
//             break;

