lab11/gap/software/nrf51822/main.c
    err_code = pstorage_init();
    APP_ERROR_CHECK(err_code);

    // Clear all bonded devices if user requests to.
    init_param.clear_persistent_data = false;
        //((nrf_gpio_pin_read(BOND_DELETE_ALL_BUTTON_ID) == 0)? true: false);

    err_code = dm_init(&init_param);
    APP_ERROR_CHECK(err_code);

    memset(&param.sec_param, 0, sizeof (ble_gap_sec_params_t));

    // Event handler to be registered with the module.
    param.evt_handler            = device_manager_event_handler;

    // Service or protocol context for device manager to load, store and apply on behalf of application.
    // Here set to client as application is a GATT client.
    param.service_type           = DM_PROTOCOL_CNTXT_GATT_CLI_ID;

    // Secuirty parameters to be used for security procedures.
    param.sec_param.bond         = SEC_PARAM_BOND;
    param.sec_param.mitm         = SEC_PARAM_MITM;
    param.sec_param.io_caps      = SEC_PARAM_IO_CAPABILITIES;
    param.sec_param.oob          = SEC_PARAM_OOB;
    param.sec_param.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
    param.sec_param.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
    param.sec_param.kdist_periph.enc = 1;
    param.sec_param.kdist_periph.id  = 1;

    err_code = dm_register(&m_dm_app_id,&param);
    APP_ERROR_CHECK(err_code);
}






/** @brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


// /**@brief Heart Rate Collector Handler.
//  */
// static void hrs_c_evt_handler(ble_hrs_c_t * p_hrs_c, ble_hrs_c_evt_t * p_hrs_c_evt)
// {
//     bool     success;
//     uint32_t err_code;

//     switch (p_hrs_c_evt->evt_type)
//     {
//         case BLE_HRS_C_EVT_DISCOVERY_COMPLETE:
//             // Initiate bonding.
//             err_code = dm_security_setup_req(&m_dm_device_handle);
//             APP_ERROR_CHECK(err_code);

//             // Heart rate service discovered. Enable notification of Heart Rate Measurement.
//             err_code = ble_hrs_c_hrm_notif_enable(p_hrs_c);
//             APP_ERROR_CHECK(err_code);

//             success = APPL_LCD_WRITE("Heart Rate", 10, LCD_UPPER_LINE, 0);
//             APP_ERROR_CHECK_BOOL(success);
//             break;

//         case BLE_HRS_C_EVT_HRM_NOTIFICATION:
//         {
//             APPL_LOG("[APPL]: HR Measurement received %d \r\n", p_hrs_c_evt->params.hrm.hr_value);

//             char hr_as_string[LCD_LLEN];

//             sprintf(hr_as_string, "Heart Rate %d", p_hrs_c_evt->params.hrm.hr_value);

//             success = APPL_LCD_WRITE(hr_as_string, strlen(hr_as_string), LCD_UPPER_LINE, 0);
//             APP_ERROR_CHECK_BOOL(success);
//             break;
//         }
//         default:
//             break;
//     }
// }


// /**@brief Battery levelCollector Handler.
//  */
// static void bas_c_evt_handler(ble_bas_c_t * p_bas_c, ble_bas_c_evt_t * p_bas_c_evt)
// {
//     bool     success;
//     uint32_t err_code;

//     switch (p_bas_c_evt->evt_type)
//     {
//         case BLE_BAS_C_EVT_DISCOVERY_COMPLETE:
//             // Batttery service discovered. Enable notification of Battery Level.
//             APPL_LOG("[APPL]: Battery Service discovered. \r\n");

//             APPL_LOG("[APPL]: Reading battery level. \r\n");

//             err_code = ble_bas_c_bl_read(p_bas_c);
//             APP_ERROR_CHECK(err_code);


//             APPL_LOG("[APPL]: Enabling Battery Level Notification. \r\n");
//             err_code = ble_bas_c_bl_notif_enable(p_bas_c);
//             APP_ERROR_CHECK(err_code);

//             break;

//         case BLE_BAS_C_EVT_BATT_NOTIFICATION:
//         {
//             APPL_LOG("[APPL]: Battery Level received %d %%\r\n", p_bas_c_evt->params.battery_level);

//             char bl_as_string[LCD_LLEN];

//             sprintf(bl_as_string, "Battery %d %%", p_bas_c_evt->params.battery_level);

//             success = APPL_LCD_WRITE(bl_as_string, strlen(bl_as_string), LCD_LOWER_LINE, 0);
//             APP_ERROR_CHECK_BOOL(success);
//             break;
//         }

//         case BLE_BAS_C_EVT_BATT_READ_RESP:
//         {
//             APPL_LOG("[APPL]: Battery Level Read as %d %%\r\n", p_bas_c_evt->params.battery_level);

//             char bl_as_string[LCD_LLEN];

//             sprintf(bl_as_string, "Battery %d %%", p_bas_c_evt->params.battery_level);

//             success = APPL_LCD_WRITE(bl_as_string, strlen(bl_as_string), LCD_LOWER_LINE, 0);
//             APP_ERROR_CHECK_BOOL(success);
//             break;
//         }
//         default:
//             break;
//     }
// }


// /**
//  * @brief Heart rate collector initialization.
//  */
// static void hrs_c_init(void)
// {
//     ble_hrs_c_init_t hrs_c_init_obj;

//     hrs_c_init_obj.evt_handler = hrs_c_evt_handler;

//     uint32_t err_code = ble_hrs_c_init(&m_ble_hrs_c, &hrs_c_init_obj);
//     APP_ERROR_CHECK(err_code);
// }


// /**
//  * @brief Battery level collector initialization.
//  */
// static void bas_c_init(void)
// {
//     ble_bas_c_init_t bas_c_init_obj;

//     bas_c_init_obj.evt_handler = bas_c_evt_handler;

//     uint32_t err_code = ble_bas_c_init(&m_ble_bas_c, &bas_c_init_obj);
//     APP_ERROR_CHECK(err_code);
// }


/**
 * @brief Database discovery collector initialization.
 */
static void db_discovery_init(void)
{
    uint32_t err_code = ble_db_discovery_init();
    APP_ERROR_CHECK(err_code);
}



/**@breif Function to start scanning.
 */
static void scan_start(void)
{
    ble_gap_whitelist_t   whitelist;
    ble_gap_addr_t        * p_whitelist_addr[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
    ble_gap_irk_t         * p_whitelist_irk[BLE_GAP_WHITELIST_IRK_MAX_COUNT];
    uint32_t              err_code;
    uint32_t              count;

    // Verify if there is any flash access pending, if yes delay starting scanning until
    // it's complete.
    err_code = pstorage_access_status_get(&count);
    APP_ERROR_CHECK(err_code);

    if (count != 0)
    {
        m_memory_access_in_progress = true;
        return;
    }

    // // Initialize whitelist parameters.
    // whitelist.addr_count = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;
    // whitelist.irk_count  = 0;
    // whitelist.pp_addrs   = p_whitelist_addr;
    // whitelist.pp_irks    = p_whitelist_irk;

    // // Request creating of whitelist.
    // err_code = dm_whitelist_create(&m_dm_app_id,&whitelist);
    // APP_ERROR_CHECK(err_code);

    // if (((whitelist.addr_count == 0) && (whitelist.irk_count == 0)) ||
    //      (m_scan_mode != BLE_WHITELIST_SCAN))
    // {
        // No devices in whitelist, hence non selective performed.
        m_scan_param.active       = 0;            // Active scanning set.
        m_scan_param.selective    = 0;            // Selective scanning not set.
        m_scan_param.interval     = SCAN_INTERVAL;// Scan interval.
        m_scan_param.window       = SCAN_WINDOW;  // Scan window.
        m_scan_param.p_whitelist  = NULL;         // No whitelist provided.
        m_scan_param.timeout      = 0x0000;       // No timeout.
    // }
    // else
    // {
    //     // Selective scanning based on whitelist first.
    //     m_scan_param.active       = 0;            // Active scanning set.
    //     m_scan_param.selective    = 1;            // Selective scanning not set.
    //     m_scan_param.interval     = SCAN_INTERVAL;// Scan interval.
    //     m_scan_param.window       = SCAN_WINDOW;  // Scan window.
    //     m_scan_param.p_whitelist  = &whitelist;   // Provide whitelist.
    //     m_scan_param.timeout      = 0x001E;       // 30 seconds timeout.

    //     // Set whitelist scanning state.
    //     m_scan_mode = BLE_WHITELIST_SCAN;
    // }

    err_code = sd_ble_gap_scan_start(&m_scan_param);
    APP_ERROR_CHECK(err_code);

    // bool lcd_write_status = APPL_LCD_WRITE("Scanning", 8, LCD_UPPER_LINE, 0);
    // if (!lcd_write_status)
    // {
    //     APPL_LOG("[APPL]: LCD Write failed!\r\n");
    // }

    // nrf_gpio_pin_set(SCAN_LED_PIN_NO);
}

int main(void)
{
    // Initialization of various modules.
 //   app_trace_init();
    led_init(LED_GOT_ADV_PACKET);

    nrf_gpio_cfg_output(INTERRUPT_PIN);
    nrf_gpio_pin_clear(INTERRUPT_PIN);



    nrf_gpio_cfg_output(ADV_PIN);
    nrf_gpio_pin_clear(ADV_PIN);

    nrf_gpio_cfg_output(3);
    nrf_gpio_pin_clear(3);

    led_on(LED_GOT_ADV_PACKET);


    ble_stack_init();

    spi_slave_example_init();


    device_manager_init();
    db_discovery_init();


  //  hrs_c_init();
  //  bas_c_init();

    // Start scanning for peripherals and initiate connection
    // with devices that advertise Heart Rate UUID.
    scan_start();


    led_on(LED_GOT_ADV_PACKET);

    for (;;)
    {
        power_manage();
    }
}


